# Nice Ride Analysis Notebook

### Import data and set up for working

In [1]:
# Import dependencies

import pandas as pd
import numpy as np
import matplotlib.pyplot as pl
import datetime

In [2]:
#Import data

csv_path = "Resources/Nice_ride_trip_history_"
year_2015 = pd.read_csv(f"{csv_path}2015_season.csv", low_memory=False)
year_2016 = pd.read_csv(f"{csv_path}2016_season.csv", low_memory=False)
year_2017 = pd.read_csv(f"{csv_path}2017_season.csv", low_memory=False)
year_2018 = pd.read_csv(f"{csv_path}2018_season.csv", low_memory=False)
year_2019 = pd.read_csv(f"{csv_path}2019_season.csv", low_memory=False)
year_2020 = pd.read_csv(f"{csv_path}2020_season.csv", low_memory=False)

In [3]:
# Create initial Data Frames
# 2015
df_2015 = pd.DataFrame(year_2015)
df_2015.head() # start date 4/1/2015

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
0,2015-04-01 08:00:00,Midtown Exchange,30008,2015-04-01 08:01:00,Midtown Exchange,30008,61,Member
1,2015-04-01 08:33:00,2nd Street N & 8th Ave. N,30092,2015-04-01 08:46:00,11th Street & Hennepin,30004,771,Member
2,2015-04-01 08:36:00,2nd Street N & 8th Ave. N,30092,2015-04-01 08:45:00,Hennepin Ave & 4th Street,30055,522,Member
3,2015-04-01 08:46:00,North 2nd Street & 4th Ave N,30011,2015-04-01 08:57:00,10th Street & Nicollet Mall,30039,679,Member
4,2015-04-01 08:56:00,Coffman Union,30024,2015-04-01 09:01:00,Riverside Ave & 23rd Ave S,30002,285,Member

In [4]:
df_2015.tail() # end date 11/1/2015

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
483224,2015-11-01 21:54:00,YWCA Downtown,30006,2015-11-01 22:44:00,YWCA Downtown,30006,3037,Casual
483225,2015-11-01 21:54:00,Lyndale Ave S & 22nd Street,30017,2015-11-01 21:55:00,Lyndale Ave S & 22nd Street,30017,65,Member
483226,2015-11-01 21:55:00,4th Street & 13th Ave SE,30009,2015-11-01 22:05:00,Logan Park,30104,565,Casual
483227,2015-11-01 21:55:00,West 15th Street & Willow,30093,2015-11-01 22:12:00,Nicollet Island,30170,980,Member
483228,2015-11-01 21:55:00,West 15th Street & Willow,30093,2015-11-01 22:12:00,Nicollet Island,30170,983,Member

In [5]:
# 2015 Fix dtypes

df_2015.start_datetime = pd.to_datetime(df_2015.start_datetime)
df_2015.end_datetime = pd.to_datetime(df_2015.end_datetime)
df_2015.start_station_name = df_2015.start_station_name.astype(str)
df_2015.end_station_name = df_2015.end_station_name.astype(str)
df_2015.account_type = df_2015.account_type.astype(str)
df_2015.start_station_id = df_2015.start_station_id.astype(str)
df_2015.end_station_id = df_2015.end_station_id.astype(str)

df_2015.dtypes

start_datetime        datetime64[ns]
start_station_name            object
start_station_id              object
end_datetime          datetime64[ns]
end_station_name              object
end_station_id                object
total_duration_sec             int64
account_type                  object
dtype: object

In [6]:
# 2016
df_2016 = pd.DataFrame(year_2016)
df_2016.head() # start date 4/4/2016

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
0,2016-04-04 08:50:00,Midtown Exchange,30008,2016-04-04 08:52:00,Midtown Exchange,30008,84,Member
1,2016-04-04 09:35:00,Washington & Marquette,30028,2016-04-04 09:51:00,Social Sciences,30019,952,Member
2,2016-04-04 10:12:00,West 15th Street & Willow,30093,2016-04-04 10:14:00,West 15th Street & Willow,30093,104,Member
3,2016-04-04 10:14:00,West 15th Street & Willow,30093,2016-04-04 10:19:00,11th Street & Hennepin,30004,292,Member
4,2016-04-04 10:19:00,Washington & Marquette,30028,2016-04-04 10:33:00,Elliot Hall,30058,870,Member

In [7]:
df_2016.tail() # end date 11/6/2016

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
432269,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1496,Casual
432270,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1494,Casual
432271,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1504,Casual
432272,2016-11-06 21:53:00,Sanford Hall,30182,2016-11-06 21:59:00,McNamara Center,30057,315,Member
432273,2016-11-06 22:09:00,Willey Hall,30195,2016-11-06 22:14:00,McNamara Center,30057,325,Casual

In [8]:
# 2016 Fix dtypes

df_2016.start_datetime = pd.to_datetime(df_2016.start_datetime)
df_2016.end_datetime = pd.to_datetime(df_2016.end_datetime)
df_2016.start_station_name = df_2016.start_station_name.astype(str)
df_2016.end_station_name = df_2016.end_station_name.astype(str)
df_2016.account_type = df_2016.account_type.astype(str)
df_2016.start_station_id = df_2016.start_station_id.astype(str)
df_2016.end_station_id = df_2016.end_station_id.astype(str)

df_2016.dtypes

start_datetime        datetime64[ns]
start_station_name            object
start_station_id              object
end_datetime          datetime64[ns]
end_station_name              object
end_station_id                object
total_duration_sec             int64
account_type                  object
dtype: object

In [9]:
# 2017
df_2017 = pd.DataFrame(year_2017)
df_2017.head() # start date 4/3/2017

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,account_type,total_duration_sec
0,2017-04-03 09:19:00,Portland Ave & Washington Ave,30090,2017-04-03 09:25:00,Currie Park,30037,Member,361
1,2017-04-03 09:27:00,Marshall Street NE & 8th Ave NE,30098,2017-04-03 09:36:00,2nd Ave S & S 3rd Street,30050,Member,532
2,2017-04-03 09:41:00,2nd Ave S & S 3rd Street,30050,2017-04-03 10:13:00,Grant Street & Portland Ave,30087,Member,1887
3,2017-04-03 09:45:00,Grant Street & Portland Ave,30087,2017-04-03 09:50:00,Hennepin County Government Center,30029,Member,340
4,2017-04-03 09:46:00,Portland Ave & Washington Ave,30090,2017-04-03 09:55:00,4th Street S & 19th Ave,30027,Member,571

In [10]:
df_2017.tail() # end date 11/5/2017

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,account_type,total_duration_sec
460713,2017-11-05 21:38:00,South 2nd Street & 3rd Ave S,30030,2017-11-05 21:44:00,6th Ave SE & University Ave,30088,Member,370
460714,2017-11-05 21:41:00,Weisman Art Museum,30183,2017-11-05 22:05:00,22nd Ave S & Franklin Ave,30014,Casual,1399
460715,2017-11-05 21:43:00,Dale Street & Grand Ave.,30106,2017-11-05 22:13:00,N Milton Street & Summit Ave,30101,Member,1817
460716,2017-11-05 21:45:00,Broadway Street N & 4th Street E,30122,2017-11-05 22:26:00,Broadway Street N & 4th Street E,30122,Member,2513
460717,2017-11-05 21:45:00,Hennepin Ave & S Washington Ave,30184,2017-11-05 22:02:00,Logan Park,30104,Member,1048

In [11]:
# 2017 Fix dtypes

df_2017.start_datetime = pd.to_datetime(df_2017.start_datetime)
df_2017.end_datetime = pd.to_datetime(df_2017.end_datetime)
df_2017.start_station_name = df_2017.start_station_name.astype(str)
df_2017.end_station_name = df_2017.end_station_name.astype(str)
df_2017.account_type = df_2017.account_type.astype(str)
df_2017.start_station_id = df_2017.start_station_id.astype(str)
df_2017.end_station_id = df_2017.end_station_id.astype(str)

df_2017.dtypes

start_datetime        datetime64[ns]
start_station_name            object
start_station_id              object
end_datetime          datetime64[ns]
end_station_name              object
end_station_id                object
account_type                  object
total_duration_sec             int64
dtype: object

In [12]:
# 2018
df_2018 = pd.DataFrame(year_2018)
df_2018.head() # start date 4/12/2018

,total_duration_sec,start_datetime,end_datetime,start_station_id,start_station_name,start_station_lat,start_station_lng,end_station_id,end_station_name,end_station_lat,end_station_lng,account_type,bike_type
0,2490,2018-04-12 08:49:49.855,2018-04-12 09:31:20.522,10.0,Midtown Exchange,44.948590,-93.260200,45.0,Franklin & Portland,44.962841,-93.267521,Member,Classic
1,228,2018-04-12 09:29:22.149,2018-04-12 09:33:10.525,16.0,22nd Ave S & Franklin Ave,44.962930,-93.241042,49.0,Franklin & 28th Ave,44.962701,-93.230893,Member,Classic
2,80,2018-04-12 10:15:30.340,2018-04-12 10:16:51.143,21.0,Social Sciences,44.970639,-93.243552,209.0,Willey Hall,44.972404,-93.242891,Member,Classic
3,755,2018-04-12 11:02:00.775,2018-04-12 11:14:36.357,10.0,Midtown Exchange,44.948590,-93.260200,31.0,Hennepin County Government Center,44.976602,-93.266701,Member,Classic
4,850,2018-04-12 11:09:51.580,2018-04-12 11:24:02.195,18.0,Walker Art Center,44.967104,-93.289075,31.0,Hennepin County Government Center,44.976602,-93.266701,Member,Classic

In [13]:
df_2018.tail() # end date 11/17/2018

,total_duration_sec,start_datetime,end_datetime,start_station_id,start_station_name,start_station_lat,start_station_lng,end_station_id,end_station_name,end_station_lat,end_station_lng,account_type,bike_type
412418,314,2018-11-17 20:53:18.470,2018-11-17 20:58:32.944,NaN,NaN,44.95,-93.28,NaN,NaN,44.96,-93.28,Casual,Dockless
412419,588,2018-11-17 21:06:47.418,2018-11-17 21:16:35.618,NaN,NaN,44.97,-93.24,NaN,NaN,44.99,-93.23,Casual,Dockless
412420,323,2018-11-17 21:47:30.035,2018-11-17 21:52:53.874,NaN,NaN,44.95,-93.29,NaN,NaN,44.95,-93.30,Casual,Dockless
412421,347,2018-11-17 23:13:49.125,2018-11-17 23:19:36.587,NaN,NaN,44.97,-93.23,NaN,NaN,44.98,-93.24,Casual,Dockless
412422,124464,2018-11-17 23:51:45.365,2018-11-19 10:26:09.952,NaN,NaN,44.96,-93.28,NaN,NaN,44.95,-93.28,Casual,Dockless

In [14]:
# 2018 Fix dtypes

df_2018.start_datetime = pd.to_datetime(df_2018.start_datetime)
df_2018.end_datetime = pd.to_datetime(df_2018.end_datetime)
df_2018.start_station_name = df_2018.start_station_name.astype(str)
df_2018.end_station_name = df_2018.end_station_name.astype(str)
df_2018.account_type = df_2018.account_type.astype(str)
df_2018.start_station_id = df_2018.start_station_id.astype(str)
df_2018.end_station_id = df_2018.end_station_id.astype(str)

df_2018.dtypes

total_duration_sec             int64
start_datetime        datetime64[ns]
end_datetime          datetime64[ns]
start_station_id              object
start_station_name            object
start_station_lat            float64
start_station_lng            float64
end_station_id                object
end_station_name              object
end_station_lat              float64
end_station_lng              float64
account_type                  object
bike_type                     object
dtype: object

In [15]:
# 2019
df_2019 = pd.DataFrame(year_2019)
df_2019.head() # start date 4/22/2019

,total_duration_sec,start_datetime,end_datetime,start_station_id,start_station_name,start_station_lat,start_station_lng,end_station_id,end_station_name,end_station_lat,end_station_lng,account_type,bike_type
0,3568,2019-04-22 09:03:33.721,2019-04-22 10:03:02.667,188.0,Sanford Hall,44.980831,-93.240282,190.0,Weisman Art Museum,44.973428,-93.237319,Member,Classic
1,223,2019-04-22 09:35:15.017,2019-04-22 09:38:58.405,188.0,Sanford Hall,44.980831,-93.240282,190.0,Weisman Art Museum,44.973428,-93.237319,Member,Classic
2,563,2019-04-22 09:37:10.081,2019-04-22 09:46:33.891,94.0,Portland Ave & Washington Ave,44.978210,-93.260230,62.0,Elliot Hall,44.976850,-93.238180,Casual,Classic
3,10159,2019-04-22 09:50:10.687,2019-04-22 12:39:29.879,188.0,Sanford Hall,44.980831,-93.240282,188.0,Sanford Hall,44.980831,-93.240282,Member,Classic
4,407,2019-04-22 09:53:28.169,2019-04-22 10:00:16.034,94.0,Portland Ave & Washington Ave,44.978210,-93.260230,95.0,Gateway Park,44.982594,-93.267514,Casual,Classic

In [16]:
df_2019.tail() # end date 11/30/2019

,total_duration_sec,start_datetime,end_datetime,start_station_id,start_station_name,start_station_lat,start_station_lng,end_station_id,end_station_name,end_station_lat,end_station_lng,account_type,bike_type
358702,708,2019-11-30 21:03:17.466,2019-11-30 21:15:06.273,NaN,NaN,44.98,-93.26,NaN,NaN,44.98,-93.26,Member,Dockless
358703,662,2019-11-30 22:00:37.126,2019-11-30 22:11:39.207,NaN,NaN,44.95,-93.32,NaN,NaN,44.95,-93.30,Member,Dockless
358704,658,2019-11-30 22:08:13.295,2019-11-30 22:19:12.128,NaN,NaN,44.98,-93.26,NaN,NaN,44.97,-93.26,Member,Dockless
358705,549,2019-11-30 23:15:00.528,2019-11-30 23:24:10.294,NaN,NaN,44.98,-93.23,NaN,NaN,44.98,-93.23,Member,Dockless
358706,276,2019-11-30 23:39:39.693,2019-11-30 23:44:16.229,NaN,NaN,44.98,-93.23,NaN,NaN,44.98,-93.23,Member,Dockless

In [17]:
# 2019 Fix dtypes

df_2019.start_datetime = pd.to_datetime(df_2019.start_datetime)
df_2019.end_datetime = pd.to_datetime(df_2019.end_datetime)
df_2019.start_station_name = df_2019.start_station_name.astype(str)
df_2019.end_station_name = df_2019.end_station_name.astype(str)
df_2019.account_type = df_2019.account_type.astype(str)
df_2019.start_station_id = df_2019.start_station_id.astype(str)
df_2019.end_station_id = df_2019.end_station_id.astype(str)

df_2019.dtypes

total_duration_sec             int64
start_datetime        datetime64[ns]
end_datetime          datetime64[ns]
start_station_id              object
start_station_name            object
start_station_lat            float64
start_station_lng            float64
end_station_id                object
end_station_name              object
end_station_lat              float64
end_station_lng              float64
account_type                  object
bike_type                     object
dtype: object

In [18]:
# 2020 
df_2020 = pd.DataFrame(year_2020)
df_2020.head() #start date 4/1/2020

,bike_type,start_datetime,end_datetime,start_station_name,start_station_id,end_station_name,end_station_id,start_station_lat,start_station_lng,end_station_lat,end_station_lng,account_type,month,day
0,docked_bike,2020-04-01 13:47:57,2020-04-01 13:48:29,NRM Bike Shop 2,609.0,NRM Bike Shop 2,609.0,44.9832,-93.2237,44.9832,-93.2237,Casual,4,1
1,docked_bike,2020-04-01 13:48:56,2020-04-01 13:49:20,NRM Bike Shop 2,609.0,NRM Bike Shop 2,609.0,44.9832,-93.2237,44.9832,-93.2237,Casual,4,1
2,docked_bike,2020-04-01 13:49:36,2020-04-01 13:49:41,NRM Bike Shop 2,609.0,NRM Bike Shop 2,609.0,44.9832,-93.2237,44.9832,-93.2237,Casual,4,1
3,docked_bike,2020-04-01 13:52:59,2020-04-01 13:53:02,NRM Bike Shop 2,609.0,NRM Bike Shop 2,609.0,44.9832,-93.2237,44.9832,-93.2237,Casual,4,1
4,docked_bike,2020-04-01 13:53:21,2020-04-01 13:53:33,NRM Bike Shop 2,609.0,NRM Bike Shop 2,609.0,44.9832,-93.2237,44.9832,-93.2237,Casual,4,1

In [19]:
df_2020.tail() #end date 11/4/2020

,bike_type,start_datetime,end_datetime,start_station_name,start_station_id,end_station_name,end_station_id,start_station_lat,start_station_lng,end_station_lat,end_station_lng,account_type,month,day
229072,electric_bike,2020-11-04 21:53:05,2020-11-04 22:57:54,22nd Ave S & Franklin Ave,16.0,22nd Ave S & Franklin Ave,16.0,44.962964,-93.241028,44.962909,-93.241065,Casual,11,4
229073,electric_bike,2020-11-04 21:58:46,2020-11-04 22:05:59,NaN,NaN,Midtown Exchange,10.0,44.970000,-93.270000,44.948456,-93.260955,Casual,11,4
229074,electric_bike,2020-11-04 22:00:22,2020-11-04 22:05:32,Marquette Ave & S 1st St,NaN,SE 4th Street & SE 3rd Ave,223.0,44.980000,-93.270000,44.986531,-93.250708,Casual,11,4
229075,electric_bike,2020-11-04 22:00:45,2020-11-04 22:04:56,NE Broadway St & NE 5th St,NaN,NaN,NaN,45.000000,-93.260000,45.010000,-93.250000,Casual,11,4
229076,electric_bike,2020-11-04 22:07:55,2020-11-04 22:22:25,NE Broadway Ave & NE Marshall St,NaN,Glenwood Ave & Gramercy Ave,NaN,45.000000,-93.270000,44.980000,-93.300000,Casual,11,4

In [20]:
# 2020 Fix dtypes

df_2020.start_datetime = pd.to_datetime(df_2020.start_datetime)
df_2020.end_datetime = pd.to_datetime(df_2020.end_datetime)
df_2020.start_station_name = df_2020.start_station_name.astype(str)
df_2020.end_station_name = df_2020.end_station_name.astype(str)
df_2020.account_type = df_2020.account_type.astype(str)
df_2020.start_station_id = df_2020.start_station_id.astype(str)
df_2020.end_station_id = df_2020.end_station_id.astype(str)

df_2020.dtypes

bike_type                     object
start_datetime        datetime64[ns]
end_datetime          datetime64[ns]
start_station_name            object
start_station_id              object
end_station_name              object
end_station_id                object
start_station_lat            float64
start_station_lng            float64
end_station_lat              float64
end_station_lng              float64
account_type                  object
month                          int64
day                            int64
dtype: object

# This is the Steph section - begin here

In [21]:
# Calculate total number of rides per day, by year
# 2015

# Split datetime column into three values
df_2015["year"] = df_2015.start_datetime.dt.year
df_2015["month"] = df_2015.start_datetime.dt.month
df_2015["day"] = df_2015.start_datetime.dt.day
df_2015.head()

# Group by month, day
per_day_15 = df_2015.groupby([df_2015.year, df_2015.month, df_2015.day]).count()
per_day_15 = pd.DataFrame(per_day_15)
per_day_15

                start_datetime  start_station_name  start_station_id  \
year month day
2015 4     1               557                 557               557
           2              1037                1037              1037
           3               692                 692               692
           4              1292                1292              1292
           5               605                 605               605
...                        ...                 ...               ...
     10    28              426                 426               426
           29              841                 841               841
           30             1040                1040              1040
           31              603                 603               603
     11    1              1047                1047              1047

                end_datetime  end_station_name  end_station_id  \
year month day
2015 4     1             557               557             557
           2            1037              1037            1037
           3             692               692             692
           4            1292              1292            1292
           5             605               605             605
...                      ...               ...             ...
     10    28            426               426             426
           29            841               841             841
           30           1040              1040            1040
           31            603               603             603
     11    1            1047              1047            1047

                total_duration_sec  account_type  year  month   day
year month day
2015 4     1                   557           557   557    557   557
           2                  1037          1037  1037   1037  1037
           3                   692           692   692    692   692
           4                  1292          1292  1292   1292  1292
           5                   605           605   605    605   605
...                            ...           ...   ...    ...   ...
     10    28                  426           426   426    426   426
           29                  841           841   841    841   841
           30                 1040          1040  1040   1040  1040
           31                  603           603   603    603   603
     11    1                  1047          1047  1047   1047  1047

[215 rows x 11 columns]

In [22]:
# 2016
# Split datetime column into three values
df_2016["year"] = df_2016.start_datetime.dt.year
df_2016["month"] = df_2016.start_datetime.dt.month
df_2016["day"] = df_2016.start_datetime.dt.day
df_2016.head()

# Group by month, day
per_day_16 = df_2016.groupby([df_2016.year, df_2016.month, df_2016.day]).count()
per_day_16 = pd.DataFrame(per_day_16)
per_day_16

                start_datetime  start_station_name  start_station_id  \
year month day
2016 4     4               197                 197               197
           5               284                 284               284
           6               471                 471               471
           7               446                 446               446
           8               436                 436               436
...                        ...                 ...               ...
     11    2              1310                1310              1310
           3              1349                1349              1349
           4              1528                1528              1528
           5              2103                2103              2103
           6              1823                1823              1823

                end_datetime  end_station_name  end_station_id  \
year month day
2016 4     4             197               197             197
           5             284               284             284
           6             471               471             471
           7             446               446             446
           8             436               436             436
...                      ...               ...             ...
     11    2            1310              1310            1310
           3            1349              1349            1349
           4            1528              1528            1528
           5            2103              2103            2103
           6            1823              1823            1823

                total_duration_sec  account_type  year  month   day
year month day
2016 4     4                   197           197   197    197   197
           5                   284           284   284    284   284
           6                   471           471   471    471   471
           7                   446           446   446    446   446
           8                   436           436   436    436   436
...                            ...           ...   ...    ...   ...
     11    2                  1310          1310  1310   1310  1310
           3                  1349          1349  1349   1349  1349
           4                  1528          1528  1528   1528  1528
           5                  2103          2103  2103   2103  2103
           6                  1823          1823  1823   1823  1823

[217 rows x 11 columns]

In [23]:
# 2017

# Split datetime column into three values
df_2017["year"] = df_2017.start_datetime.dt.year
df_2017["month"] = df_2017.start_datetime.dt.month
df_2017["day"] = df_2017.start_datetime.dt.day
df_2017.head()

# Group by month, day
per_day_17 = df_2017.groupby([df_2017.year, df_2017.month, df_2017.day]).count()
per_day_17 = pd.DataFrame(per_day_17)
per_day_17

                start_datetime  start_station_name  start_station_id  \
year month day
2017 4     3               543                 543               543
           4              1385                1385              1385
           5              1205                1205              1205
           6              1305                1305              1305
           7              1659                1659              1659
...                        ...                 ...               ...
     11    1               521                 521               521
           2               665                 665               665
           3               552                 552               552
           4               324                 324               324
           5               282                 282               282

                end_datetime  end_station_name  end_station_id  account_type  \
year month day
2017 4     3             543               543             543           543
           4            1385              1385            1385          1385
           5            1205              1205            1205          1205
           6            1305              1305            1305          1305
           7            1659              1659            1659          1659
...                      ...               ...             ...           ...
     11    1             521               521             521           521
           2             665               665             665           665
           3             552               552             552           552
           4             324               324             324           324
           5             282               282             282           282

                total_duration_sec  year  month   day
year month day
2017 4     3                   543   543    543   543
           4                  1385  1385   1385  1385
           5                  1205  1205   1205  1205
           6                  1305  1305   1305  1305
           7                  1659  1659   1659  1659
...                            ...   ...    ...   ...
     11    1                   521   521    521   521
           2                   665   665    665   665
           3                   552   552    552   552
           4                   324   324    324   324
           5                   282   282    282   282

[217 rows x 11 columns]

In [26]:
# 2018
# Split datetime column into three values
df_2018["year"] = df_2018.start_datetime.dt.year
df_2018["month"] = df_2018.start_datetime.dt.month
df_2018["day"] = df_2018.start_datetime.dt.day
df_2018.head()

# Group by month, day
per_day_18 = df_2018.groupby([df_2018.year, df_2018.month, df_2018.day]).count()
per_day_18 = pd.DataFrame(per_day_18)
per_day_18

                total_duration_sec  start_datetime  end_datetime  \
year month day
2018 4     12                  212             212           212
           13                  202             202           202
           14                   19              19            19
           15                   17              17            17
           16                   32              32            32
...                            ...             ...           ...
     11    13                  130             130           130
           14                  122             122           122
           15                   84              84            84
           16                   86              86            86
           17                   43              43            43

                start_station_id  start_station_name  start_station_lat  \
year month day
2018 4     12                212                 212                212
           13                202                 202                202
           14                 19                  19                 19
           15                 17                  17                 17
           16                 32                  32                 32
...                          ...                 ...                ...
     11    13                130                 130                130
           14                122                 122                122
           15                 84                  84                 84
           16                 86                  86                 86
           17                 43                  43                 43

                start_station_lng  end_station_id  end_station_name  \
year month day
2018 4     12                 212             212               212
           13                 202             202               202
           14                  19              19                19
           15                  17              17                17
           16                  32              32                32
...                           ...             ...               ...
     11    13                 130             130               130
           14                 122             122               122
           15                  84              84                84
           16                  86              86                86
           17                  43              43                43

                end_station_lat  end_station_lng  account_type  bike_type  \
year month day
2018 4     12               212              212           212        212
           13               202              202           202        202
           14                19               19            19         19
           15                17               17            17         17
           16                32               32            32         32
...                         ...              ...           ...        ...
     11    13               130              130           130        130
           14               122              122           122        122
           15                84               84            84         84
           16                86               86            86         86
           17                43               43            43         43

                year  month  day
year month day
2018 4     12    212    212  212
           13    202    202  202
           14     19     19   19
           15     17     17   17
           16     32     32   32
...              ...    ...  ...
     11    13    130    130  130
           14    122    122  122
           15     84     84   84
           16     86     86   86
           17     43     43   43

[220 rows x 16 columns]

In [27]:
# 2019
# Split datetime column into three values
df_2019["year"] = df_2019.start_datetime.dt.year
df_2019["month"] = df_2019.start_datetime.dt.month
df_2019["day"] = df_2019.start_datetime.dt.day
df_2019.head()

# Group by month, day
per_day_19 = df_2019.groupby([df_2019.year, df_2019.month, df_2019.day]).count()
per_day_19 = pd.DataFrame(per_day_19)
per_day_19

                total_duration_sec  start_datetime  end_datetime  \
year month day
2019 4     22                  156             156           156
           23                 1100            1100          1100
           24                 1351            1351          1351
           25                 1387            1387          1387
           26                 1387            1387          1387
...                            ...             ...           ...
     11    26                  214             214           214
           27                   27              27            27
           28                   11              11            11
           29                   29              29            29
           30                   20              20            20

                start_station_id  start_station_name  start_station_lat  \
year month day
2019 4     22                156                 156                156
           23               1100                1100               1100
           24               1351                1351               1351
           25               1387                1387               1387
           26               1387                1387               1387
...                          ...                 ...                ...
     11    26                214                 214                214
           27                 27                  27                 27
           28                 11                  11                 11
           29                 29                  29                 29
           30                 20                  20                 20

                start_station_lng  end_station_id  end_station_name  \
year month day
2019 4     22                 156             156               156
           23                1100            1100              1100
           24                1351            1351              1351
           25                1387            1387              1387
           26                1387            1387              1387
...                           ...             ...               ...
     11    26                 214             214               214
           27                  27              27                27
           28                  11              11                11
           29                  29              29                29
           30                  20              20                20

                end_station_lat  end_station_lng  account_type  bike_type  \
year month day
2019 4     22               156              156           156        156
           23              1100             1100          1100       1100
           24              1351             1351          1351       1351
           25              1387             1387          1387       1387
           26              1387             1387          1387       1387
...                         ...              ...           ...        ...
     11    26               214              214           214        214
           27                27               27            27         27
           28                11               11            11         11
           29                29               29            29         29
           30                20               20            20         20

                year  month   day
year month day
2019 4     22    156    156   156
           23   1100   1100  1100
           24   1351   1351  1351
           25   1387   1387  1387
           26   1387   1387  1387
...              ...    ...   ...
     11    26    214    214   214
           27     27     27    27
           28     11     11    11
           29     29     29    29
           30     20     20    20

[223 rows x 16 columns]

In [28]:
# 2020
# Split datetime column into three values
df_2020["year"] = df_2020.start_datetime.dt.year
df_2020["month"] = df_2020.start_datetime.dt.month
df_2020["day"] = df_2020.start_datetime.dt.day
df_2020.head()

# Group by month, day
per_day_20 = df_2020.groupby([df_2020.year, df_2020.month, df_2020.day]).count()
per_day_20 = pd.DataFrame(per_day_20)
per_day_20

                bike_type  start_datetime  end_datetime  start_station_name  \
year month day
2020 4     1          303             303           303                 303
           2          194             194           194                 194
           3          215             215           215                 215
           4          278             278           278                 278
           6          126             126           126                 126
...                   ...             ...           ...                 ...
     10    31         427             427           427                 427
     11    1          270             270           270                 270
           2          417             417           417                 417
           3          762             762           762                 762
           4          651             651           651                 651

                start_station_id  end_station_name  end_station_id  \
year month day
2020 4     1                 303               303             303
           2                 194               194             194
           3                 215               215             215
           4                 278               278             278
           6                 126               126             126
...                          ...               ...             ...
     10    31                427               427             427
     11    1                 270               270             270
           2                 417               417             417
           3                 762               762             762
           4                 651               651             651

                start_station_lat  start_station_lng  end_station_lat  \
year month day
2020 4     1                  303                303              303
           2                  194                194              194
           3                  215                215              215
           4                  278                278              278
           6                  126                126              126
...                           ...                ...              ...
     10    31                 427                427              425
     11    1                  270                270              269
           2                  417                417              416
           3                  762                762              762
           4                  651                651              648

                end_station_lng  account_type  month  day  year
year month day
2020 4     1                303           303    303  303   303
           2                194           194    194  194   194
           3                215           215    215  215   215
           4                278           278    278  278   278
           6                126           126    126  126   126
...                         ...           ...    ...  ...   ...
     10    31               425           427    427  427   427
     11    1                269           270    270  270   270
           2                416           417    417  417   417
           3                762           762    762  762   762
           4                648           651    651  651   651

[216 rows x 15 columns]

In [29]:
#Calculate daily rides by year

#2015
daily_rides_15 = list(per_day_15.account_type)
print(f"2015: {len(daily_rides_15)}")

#2016
daily_rides_16 = list(per_day_16.account_type)
print(f"2016: {len(daily_rides_16)}")

#2017
daily_rides_17 = list(per_day_17.account_type)
print(f"2017: {len(daily_rides_17)}")
      
#2018
daily_rides_18 = list(per_day_18.account_type)
print(f"2018: {len(daily_rides_18)}")

#2019
daily_rides_19 = list(per_day_19.account_type)
print(f"2019: {len(daily_rides_19)}")

#2020
daily_rides_20 = list(per_day_20.account_type)
print(f"2020: {len(daily_rides_20)}")
#daily_rides_20

2015: 215
2016: 217
2017: 217
2018: 220
2019: 223
2020: 216

In [ ]:
# It is necessary for all year to hold the same number of values
# We have to extrapolate the values that make the most sense
# For values that begin or end a year's data set, we should insert a zero:

In [ ]:
years = ["2015", "2016", "2017", "2018", "2019", "2020"]
months = [4, 5, 6, 7, 8, 9, 10, 11]
for year in years:
    for month in months:

In [ ]:
rides_by_month = pd.DataFrame({"2015" : [daily_rides_15],
                               "2016" : "daily_rides_16",
                               "2017" : "daily_rides_17"})

# This is the end of the Steph section